Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetReportedShape(Autodesk.Revit.DB.ElementId)
This method changes the RebarShape of a Free Form Rebar that is using RebarWorkInstructions.Straight property to the provided RebarShape.
Remarks:
The Rebar element RebarWorkInstructions property should be Straight.
The rebarShapeId parameter should be the id of a straight RebarShape (single straight segment, no RebarHookType, no EndTreatmentType).
Moreover the straight RebarShape RebarStyle should match ( if the current RebarShape RebarStyle is Standard then the RebarShape cannot be changed to a straigh RebarShape using the RebarStyle Stirrup/Tie ).
If current RebarShape and the provided rebarShapeId has Stirrup/Tie RebarStyle then also the StirrupTieAttachmentType should match ( both InteriorFace or ExteriorFace ).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShapeId cannot be set as a reporting RebarShape for this Rebar element.
Since:
2022

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.DisconnectFromServer
Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed).
Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetCurves(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Set the curves into a free form Rebar.  Will throw exception if the rebar has valid constraints.
Remarks:
This function can fail due to following reasons:
The array of CurveLoops is empty.
At least one CurveLoop is empty.
At least one CurveLoop contains an unbounded curve.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Each curve loop represents a bar in the set.
Returns:
Returns Success if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetCurves(System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.Curve}})
Set the curves into a free form Rebar.  Will throw exception if the rebar has valid constraints.
Remarks:
This function can fail due to following reasons:
One or more of the input curves was null.
One or more of the input curves was unbounded.
Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.
A rebar constructed from curves can't be bent according to the bending radius.
curves:
Each array of curves represent a bar in the set.
Returns:
Returns Success(0) if everything is ok, otherwise the failure reason.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.CanBeHookNormal(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
A vector can be hook normal if for a bar specified by index, the bar direction is not parallel with the vector.
barIndex:
The index of bar for which it will try to see if hook normal is applicable.
end:
The end of bar. Should be 0 for start, 1 for end.
normal:
The hook plane normal that will be tested.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookOrientationAngle(System.Int32,System.Double)
Set the hook orientation angle at end. Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
angle:
The hook orientation angle at end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
hookNormal:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Normal hookNormal for end end isn't a valid normal for bar with index barPositionIndex
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
-or-
hookNormal has zero length.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidAlignedServer
Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.
Returns:
Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise.
Since:
2024

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetUpdatingSharedParameters
Get the shared parameters listed as dependencies in the calculation of the rebar curves
Returns:
Returns the elementIds of the shared parameters
Since:
2020

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.RemoveUpdatingSharedParameter(Autodesk.Revit.DB.ElementId)
Remove existing shared parameter as a dependency for the calculation of the rebar curves.
Remarks:
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
parameterId:
ElementId of the shared parameter to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
-or-
parameterId is a parameter that is not bound to the Rebar element category.
Since:
2020

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.AddUpdatingSharedParameter(Autodesk.Revit.DB.ElementId)
Add existing shared parameter as a dependency for the calculation of the rebar curves.
Remarks:
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
parameterId:
ElementId of the shared parameter to be added.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
-or-
parameterId is a parameter that is not bound to the Rebar element category.
Since:
2020

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetShapeIdAtIndex(System.Int32)
Gets the Rebar Shape id for the bar with index barPositionIndex.
Remarks:
If this function is called for a bar that isn't included, this function will throw exception.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
Gets the ElementId of the Rebar Shape for the bar with index barPositionIndex.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
The bar at barPositionIndex index is excluded.
Since:
2019

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsMinimumClearSpacing(System.Double)
Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
spacing:
The maximum spacing of bars in set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsMaximumSpacing(System.Double)
Sets the Layout Rule property of rebar set to Maximum Spacing.
spacing:
The maximum spacing of bars in set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsFixedNumber(System.Int32)
Sets the Layout Rule property of rebar set to Fixed Number.
numberOfBars:
The number of bars in set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsNumberWithSpacing(System.Int32,System.Double)
Sets the Layout Rule property of rebar set to Number With Spacing.
numberOfBars:
The number of bars in set.
spacing:
The spacing of bars in set.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsSingle
Sets the Layout Rule property of rebar set to Single.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.AlignedFreeFormSetOrientationOptions
Orientation options for an Aligned Free Form Rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar is not created with the Aligned Free Form rebar server.
Since:
2024

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.CycleCounter
Identifies the cycle counter. It can be zero or a pozitive number.
Its value is changed when the free form Rebar element is selected and the user press Space key
-or- through the setter of this property
-or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0).
This property can be accessed just for Rebars that are controlled by a server.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for cycleCounter is negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2024

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.StirrupTieAttachmentType
Identifies the StirrupTieAttachmentType of the current Rebar element.
The RebarStyle of the Rebar element must be StirrupTie.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.RebarStyle
Identifies the RebarStyle of the current Rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.WorkshopInstructions
Identifies the workshop instructions of the current Rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2019